app/views/portfolios/show.html.erb

SELECT "technologies".* FROM "technologies" WHERE "technologies"."portfolio_id" = ?  [["portfolio_id", 13]]
---

      <% @portfolio_item.technologies.each do |t| %>