app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
---
  def index
    if logged_in?(:site_admin)
    @blogs = Blog.page(params[:page])

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = 7
---
  def show
    if logged_in?(:site_admin) || @blog.published?
      @blog = Blog.includes(:comments).friendly.find(params[:id])

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?)  [["title", "awefawf"], ["body", " wer werawef"], ["created_at", "2018-04-02 00:27:07.050540"], ["updated_at", "2018-04-02 00:27:07.050540"], ["slug", "awefawf"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "body" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["body", " wer werawefae f ae fqwefg "], ["updated_at", "2019-01-06 01:21:34.411164"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_blog
      @blog = Blog.friendly.find(params[:id])