app/controllers/portfolios_controller.rb

  def create
    @portfolio_item = Portfolio.new(portfolio_params)

    respond_to do |format|
      if @portfolio_item.save
---
INSERT INTO "portfolios" ("title", "subtitle", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "afaf"], ["subtitle", "afa"], ["body", "sdks"], ["created_at", "2018-02-20 00:25:36.563327"], ["updated_at", "2018-02-20 00:25:36.563327"]]

  def update
    respond_to do |format|
      if @portfolio_item.update(portfolio_params)
---
UPDATE "portfolios" SET "main_image" = ?, "thumb_image" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?  [["main_image", "easyHTTP_2019-01-06_at_1.27.54_AM__1_.jpg"], ["thumb_image", "easyHTTP_2019-01-06_at_1.27.54_AM__1_.jpg"], ["updated_at", "2019-01-06 03:32:47.924014"], ["id", 13]]

  def destroy
    # Destroy/delete the record
    @portfolio_item.destroy
---
DELETE FROM "portfolios" WHERE "portfolios"."id" = ?  [["id", 1]]

  def set_portfolio_item
    @portfolio_item = Portfolio.find(params[:id])
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]